app/Models/ProductosModel.php

INSERT INTO `productos` (`nombre`) VALUES ('coca cola')
---
    public function insertarProducto($data)
    {
        return $this->insert($data);

UPDATE `productos` SET `nombre` = 'ron'
WHERE `productos`.`idproducto` IN ('3')
---
    public function updateProductos($id,$data){
        return $this->update($id,$data);